import React from 'react'

const Bengali = () => {
    return (
        <div className='language'>
            <h1>React.js কি? (ব্যবহার, উদাহরণ এবং আরও অনেক কিছু)</h1>
            <h3>What is React.js? (Uses, Examples, & More)</h3>
            <p>আজ, ফ্রন্ট-এন্ড ফ্রেমওয়ার্ক এবং লাইব্রেরি আধুনিক ওয়েব ডেভেলপমেন্ট স্ট্যাকের একটি অপরিহার্য অংশ হয়ে উঠছে। React.js হল একটি ফ্রন্ট-এন্ড লাইব্রেরি যা ধীরে ধীরে জাভাস্ক্রিপ্ট সম্প্রদায়ের মধ্যে আধুনিক ওয়েব ডেভেলপমেন্টের জন্য গো-টু ফ্রেমওয়ার্ক হয়ে উঠেছে।</p>
            <p>যারা ওয়েব ডেভেলপমেন্টে নতুন, বা সমস্ত ঝামেলা কিসের জন্য তা বোঝার চেষ্টা করছেন, আসুন প্রতিক্রিয়া দেখি, এটি কীভাবে কাজ করে এবং এটিকে অন্যান্য জাভাস্ক্রিপ্ট ফ্রেমওয়ার্ক থেকে আলাদা করে।</p>
            <img src="https://cdn.hashnode.com/res/hashnode/image/upload/v1625576291410/by9FKZ3ek.png" alt="react imaage" style={{ height: '300px', width: "400px" }} />
            <h2 style={{ display: 'flex', justifyContent: 'flex-start', padding: '0 100px' }}>React.js কি?</h2>
            <p>React.js ফ্রেমওয়ার্ক হল একটি ওপেন সোর্স জাভাস্ক্রিপ্ট ফ্রেমওয়ার্ক এবং লাইব্রেরি যা Facebook দ্বারা তৈরি করা হয়েছে। এটি ভ্যানিলা জাভাস্ক্রিপ্টের তুলনায় উল্লেখযোগ্যভাবে কম কোড সহ দ্রুত এবং দক্ষতার সাথে ইন্টারেক্টিভ ইউজার ইন্টারফেস এবং ওয়েব অ্যাপ্লিকেশন তৈরি করতে ব্যবহৃত হয়।</p>

               <p> প্রতিক্রিয়াতে, আপনি পুনরায় ব্যবহারযোগ্য উপাদান তৈরি করে আপনার অ্যাপ্লিকেশনগুলি বিকাশ করেন যা আপনি স্বাধীন লেগো ব্লক হিসাবে ভাবতে পারেন। এই উপাদানগুলি একটি চূড়ান্ত ইন্টারফেসের পৃথক টুকরো, যা একত্রিত হলে, অ্যাপ্লিকেশনটির সম্পূর্ণ ব্যবহারকারী ইন্টারফেস তৈরি করে।</p>

                <p> একটি অ্যাপ্লিকেশনে প্রতিক্রিয়ার প্রাথমিক ভূমিকা হল মডেল-ভিউ-কন্ট্রোলার (MVC) প্যাটার্নে সেরা এবং সবচেয়ে দক্ষ রেন্ডারিং এক্সিকিউশন প্রদানের মাধ্যমে সেই অ্যাপ্লিকেশনটির ভিউ লেয়ারটি পরিচালনা করা। পুরো ইউজার ইন্টারফেসকে একটি একক হিসাবে ডিল করার পরিবর্তে, React.js ডেভেলপারদের এই জটিল UI গুলিকে পৃথক পুনঃব্যবহারযোগ্য উপাদানগুলিতে আলাদা করতে উত্সাহিত করে যা পুরো UI এর বিল্ডিং ব্লক তৈরি করে। এটি করতে গিয়ে, ReactJS ফ্রেমওয়ার্ক জাভাস্ক্রিপ্টের গতি এবং দক্ষতাকে একত্রিত করে DOM-কে ম্যানিপুলেট করার আরও কার্যকর পদ্ধতির সাথে ওয়েব পেজগুলিকে দ্রুত রেন্ডার করতে এবং অত্যন্ত গতিশীল এবং প্রতিক্রিয়াশীল ওয়েব অ্যাপ্লিকেশন তৈরি করতে।</p>
        </div>
    )
}

export default Bengali