import React from 'react'

const Hindi = () => {
    return (
        <div className='language'>
            <h1>React.js क्या है? (उपयोग, उदाहरण और अधिक)</h1>
            <h3>What is React.js? (Uses, Examples, & More)</h3>
            <p>आज, फ्रंट-एंड फ्रेमवर्क और लाइब्रेरी आधुनिक वेब डेवलपमेंट स्टैक का एक अनिवार्य हिस्सा बन रहे हैं। React.js एक फ्रंट-एंड लाइब्रेरी है जो धीरे-धीरे जावास्क्रिप्ट समुदाय के भीतर आधुनिक वेब विकास के लिए महत्वपूर्ण रूपरेखा बन गई है।</p>
            <p>उन लोगों के लिए जो वेब डेवलपमेंट में नए हैं, या यह पता लगाने की कोशिश कर रहे हैं कि सारा उपद्रव किस बारे में है, आइए रिएक्ट पर नजर डालें, यह कैसे काम करता है, और क्या इसे अन्य जावास्क्रिप्ट फ्रेमवर्क से अलग बनाता है।</p>
            <img src="https://cdn.hashnode.com/res/hashnode/image/upload/v1625576291410/by9FKZ3ek.png" alt="react imaage" style={{height:'300px', width:"400px"}} />
            <h2 style={{display:'flex', justifyContent:'flex-start', padding:'0 100px'}}>React.js क्या है?</h2>
            <p>React.js फ्रेमवर्क फेसबुक द्वारा विकसित एक ओपन-सोर्स जावास्क्रिप्ट फ्रेमवर्क और लाइब्रेरी है। इसका उपयोग वेनिला जावास्क्रिप्ट की तुलना में काफी कम कोड के साथ तेजी से और कुशलता से इंटरैक्टिव यूजर इंटरफेस और वेब एप्लिकेशन बनाने के लिए किया जाता है।</p>

<p>रिएक्ट में, आप पुन: प्रयोज्य घटकों का निर्माण करके अपने एप्लिकेशन विकसित करते हैं जिन्हें आप स्वतंत्र लेगो ब्लॉक के रूप में सोच सकते हैं। ये घटक अंतिम इंटरफ़ेस के अलग-अलग टुकड़े हैं, जो इकट्ठे होने पर एप्लिकेशन का संपूर्ण उपयोगकर्ता इंटरफ़ेस बनाते हैं।</p>

<p>किसी एप्लिकेशन में रिएक्ट की प्राथमिक भूमिका सबसे अच्छा और सबसे कुशल रेंडरिंग निष्पादन प्रदान करके मॉडल-व्यू-कंट्रोलर (एमवीसी) पैटर्न में वी की तरह उस एप्लिकेशन की व्यू लेयर को संभालना है। संपूर्ण उपयोगकर्ता इंटरफ़ेस को एक इकाई के रूप में संभालने के बजाय, React.js डेवलपर्स को इन जटिल UI को अलग-अलग पुन: प्रयोज्य घटकों में अलग करने के लिए प्रोत्साहित करता है जो संपूर्ण UI के बिल्डिंग ब्लॉक बनाते हैं। ऐसा करने में, ReactJS फ्रेमवर्क वेब पेजों को तेजी से प्रस्तुत करने और अत्यधिक गतिशील और उत्तरदायी वेब एप्लिकेशन बनाने के लिए DOM में हेरफेर करने की अधिक कुशल विधि के साथ जावास्क्रिप्ट की गति और दक्षता को जोड़ता है।</p>
        </div>
    )
}

export default Hindi